app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE (created_at >= NULL AND created_at <= NULL)
---
  def index
    #binding.pry
    search = params['search'] # esto trae el parametro de busqueda
    @books = search.present? ? Book.by_title(search['title']) : Book.all

INSERT INTO "books" ("title", "year_published", "isbn", "price", "out_of_print", "views", "supplier_id", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save